examples/openfoam7/singleBuilding/kOmegaSST_F1blend/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

kappa               0.4;
zDir                (0 0 1);
flowDir             (1 0 0);
z0                  0.00075;

// Calculate ABL friction velocity U*
Uref                6.73;
Zref                1.0;
ustar               #calc "$Uref*$kappa / log(($Zref+$z0) / $z0)";

// ************************************************************************* //

// Curve-fitting coefficients for TKE profile

// A*log((z + z0)/z) + B*sqr((z + z0)/z0) + C(z + z0)/z0)+ D + E*log(z + z0)
// Note: If Zmax is large, code may fail due to negative value under sqrt

A               0;
B               0;
C               0;
D               0.52;     //C2 in Bellegoni
E               -0.04;    //C1 in Bellegoni

// Alternative TKE profile
BW              0;        // Flag for alternative TKE profile
hABL            1;        // TKE profile parameter, used when BW is selected

// ************************************************************************* //

// Blending coefficient
// For sinosodial blending, larger blending coefficient (i.e. alpha) results in a sharper detection of the BIA.
// maximum extension reached with alpha = 32.
// See Longo et al (2017)
blendCoeff      1;       // Blending coefficient "alpha" in Eq.22 Bellegoni et al (2023). Values e.g.: 1, 4, 32

// Turbulence model constants upper limit
CmuMax          0.35;     // Upper limit for Cmu in undistrubed flow (kEpsilon)
betaStarMax     0.35;     // Upper limit for betaStarMax in undisturbed flow (kOmegaSST)

// Turbulence model constants in distrubed region / wake field (WF)
WFCmu           0.09;    // kEpsilon
WFbetaStar      0.09;    // kOmegaSST

// ************************************************************************* //

// Threshold/minimum deviation of U, k, epsilon, omega (%) to detect distrubed region
thresholdU      0.0;
thresholdK      0.0;
thresholdE      0.0;
thresholdO      0.0;

// Attenuation parameters to avoid over-extending of disturbed region (Building Influence Area).
// =1/A in Eq. 23 of Bellegoni et al (2023)
constantU       1;        // Au = 1
constantK       10;       // Ak = 0.1
constantE       10;       // Ae = 0.1
constantO       10;       // Ae = 0.1

// Method for detecting disturbed region (Building Influence Area) - see Table 2 - Longo et al (2020)
// (1 0 0) : Pure U blending - Detects BIA based on deviation of U
// (0 1 0) : Pure K blending - Detects BIA based on deviation of K
// (0 0 1) : Hybrid blending - Detects BIA based on deviation of max(U, k, epsilon/omega)
msel            (0 0 1);
